# -------------------------------------------------------------------------------------------------------------------------------
"""
1. Создать список и заполнить его элементами различных типов данных. 
Реализовать скрипт проверки типа данных каждого элемента. 
Использовать функцию type() для проверки типа. 
Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
"""
# -------------------------------------------------------------------------------------------------------------------------------
import sys


def input_data():
    print("Введите данные разных типов через пробел (например: Сестра помыла 1.5 окна. Сестре 20 лет. )")
    line = sys.stdin.readline().rstrip()
    line_data = list()

    for i in line.split():
        try:
            temp_data = int(i)
        except ValueError:
            try:
                temp_data = float(i)
            except ValueError:
                temp_data = str(i)
        line_data.append(temp_data)

    return line_data


def get_type(list_data):
    print(f"Список: {list_data}")
    for i in list_data:
        print(f"Элемент строки: {i}, имеет тип: {type(i)}")


def main():
    data = input_data()
    get_type(data)


if __name__ == '__main__':
    print("Задание №1")
    main()
# -------------------------------------------------------------------------------------------------------------------------------
